summer2018/psyc5379/psyc5379-summer2018.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>PSYC 5379 / READ 5379: Advanced Psycholinguistics</title>
<!-- 2018-06-05 Tue 09:59 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">PSYC 5379 / READ 5379: Advanced Psycholinguistics</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Contact info</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Professor: Thomas J. Faulkenberry, Ph.D
</li>
<li>Office: Math 319
</li>
<li>Office hours: MTWRF 9-11 am (or by appointment)
</li>
<li>Email: faulkenberry@tarleton.edu
</li>
<li>Website: <a href="http://tomfaulkenberry.github.io">http://tomfaulkenberry.github.io</a>
</li>
<li>Phone: 254-968-9816
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Course description</h2>
<div class="outline-text-2" id="text-2">
<p>
(from catalog) <i>The course emphasizes the study of language, understanding languages, producing language and speech, language development, and related topics such as reading, language and the brain, linguistic diversity, and universals.</i>
</p>

<p>
Psycholinguistics is an area of specialization within cognitive psychology that focuses on the psychological mechanisms of language processing.  This course provides an introduction to the field of psycholinguistics. Psycholinguistics is the field that studies the information processing mechanisms that govern the use of language in comprehension and production, acquisition, and representation.  A common misconception is that one learns about the specifics of particular languages in a course on psycholinguistics.  This is not the case.  Rather, like most of cognitive psychology, this course emphasizes the <i>commonalities</i> that underlie human languages everywhere, and we will focus on what these commonalities tell us about the human ability to construct and understand language. 
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Course materials</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><i>The Psychology of Language: From Data to Theory (4th ed.)</i> by Harley <a href="https://www.amazon.com/Psychology-Language-Data-Theory/dp/1848720890">Amazon link</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Student learning outcomes</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Define the basic vocabulary of psycholinguistics
</li>
<li>Discuss the biological bases of human communication.
</li>
<li>Describe how humans perceive and produce speech.
</li>
<li>Describe how sentences and discourse are processed and comprehended. 
</li>
<li>Discuss the acquisition of language. 
</li>
<li>Describe the psychological processes involved in reading.
</li>
<li>Identify and explain problems in speech and language processes.
</li>
<li>Explain bilingualism and second language acquisition.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Texas Reading Specialist Standards</h2>
<div class="outline-text-2" id="text-5">
<p>
For students enrolled in READ 5379, our course content will cover the following standards from TEA (Texas Education Agency) for EC-12 Reading Specialist certification.
</p>

<ul class="org-ul">
<li>1.1k: know and understand the basic linguistic patterns and structures of oral language, such as continuant and stop sounds and coarticulation of sounds
</li>
<li>1.2k: know and understand relationships between oral language development and the development of reading skills, such as the expected stages and milestones in acquiring oral language; implications of individual variations in oral language development for reading; and ways to use the cultural, linguistic, and home backgrounds of students to develop and enhance students’ oral language 
</li>
<li>1.4k: know and understand expected stages and patterns in the development of phonological and phonemic awareness, implications of individual variations in the development of phonological and phonemic awareness, and instructional sequences that develop and accelerate students’ phonological and phonemic awareness and are based on a convergence of research evidence
</li>
<li>1.6k: know and understand the development of concepts of print (e.g., left-right progression, spaces between words)
</li>
<li>1.7k: know and understand the relationship between concepts of print and other reading-related skills.
</li>
<li>1.8k: know and understand the elements of the alphabetic principle, including letter names, graphophonemic knowledge, and the relationship of the letters in printed words to spoken language
</li>
<li>1.9k: know and understand expected stages and patterns in students’ developing understanding of the alphabetic principle and implications of individual variations in the development of this understanding
</li>
<li>1.10k: know and understand instructional strategies that develop and accelerate students’ application of the alphabetic principle to beginning decoding and that are based on a convergence of research evidence
</li>
<li>1.14k: know and understand expected patterns of development in the use of word identification strategies, implications of individual variations in development in this area, and instructional strategies that develop and accelerate students’ skills in word identification and are based on a convergence of research evidence
</li>
<li>1.17k: know and understand expected patterns of development in reading fluency (including developmental benchmarks), implications of individual variations in the development of fluency, and instructional strategies that develop students’ fluency and are based on a convergence of research evidence
</li>
<li>1.19k: know and understand a variety of comprehension theories/models (e.g., transactional, interactive, metacognitive, socio-psycho linguistic, constructivist) and their impact on instructional strategies
</li>
<li>1.29k: know and understand predictable stages in the development of written language and writing conventions, including the physical and/or cognitive processes involved in letter formation, word writing, sentence construction, spelling, punctuation, and grammatical expression, while recognizing that individual variations occur
</li>
<li>2.17k: know and understand how differences in dialect or vocabulary development may affect a student’s acquisition of reading skills;
</li>
<li>3.2k: know and understand issues and concepts related to the transfer of literacy competency from one language to another
</li>
<li>3.3k: know and understand expected stages and patterns of first- and second-language learning
</li>
<li>3.7k: know and understand characteristics and instructional implications of reading difficulties, dyslexia, and reading disabilities in relation to the development of reading competence
</li>
<li>4.1k: know and understand the major theories of language acquisition, reading, cognition, and learning (e.g., behaviorism, cognitivism, constructivism, transactionalism);
</li>
<li>4.7k: know and understand foundations of basic research design, methodology, and application
</li>
<li>4.8k: know and understand methods and criteria for critically reviewing research on reading and selecting research for educational applications.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Requirements and grading</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Exam 1 (100 pts)
</li>
<li>Exam 2 (100 pts)
</li>
<li>Exam 3 (100 pts)
</li>
<li>Exam 4 (100 pts)
</li>
<li>Unit quizzes (100 pts)
</li>
<li>Review paper (100 pts)
</li>
<li><i>Total = 600 points</i>
</li>
</ul>

<p>
Grades will be assigned based on the percentage of points you accumulate out of these 500 points.  I will use the standard grading scale of A=90%, B=80%, etc.
</p>
</div>
